src/cf/Enums/ТипыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьУдалитьЗаполняемыйПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоЗадачеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияИсполненияПроцессами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессамиНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьHtmlПередОзнакомлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОзнакомленияЦеликомЕслиНужно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПоСостояниюДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПриПеренаправлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуУчастникаМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьОбработкуОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьПроцессБезДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьИзменениеКонтейнеровДля2ФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьПринятиеКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКВыполнениюДействияВнеОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренаправлениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносСрокаВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьПредметКСогласованиюВРежимеЗамечаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрерватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьHtmlПриНачалеСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохранитьРезультатВыполненияВЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартоватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьДанныеДляПредпросмотраФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляИсполнителейДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляОбработкиОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляПунктаДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляРассматривающегоДействияИсполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыЗаданий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание типа
// 
// Параметры:
// 	Тип - ПеречислениеСсылка.ТипыЗаданий
// 	
// Возвращаемое значение: Структура(Сеанс (Строка - "Клиент" "Сервер"), ДолгоеЗадание(Булево))
// 	
Функция ОписаниеТипаЗадания(Тип) Экспорт
	
	ОписаниеТипа = Новый Структура ("Сеанс, ДолгоеЗадание");
	
	ТипЗаданий = Перечисления.ТипыЗаданий;
	
	Если Тип = ТипЗаданий.СтартоватьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияПроцессом Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;			
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияСогласованияПроцессом Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияИсполненияПроцессами Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияПроцессамиНовыеУчастники Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляРассматривающегоДействияИсполнения Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляПунктаДействияИсполнения Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляИсполнителейДействияИсполнения Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПодготовитьПредметКСогласованиюВРежимеЗамечаний Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СоздатьHtmlПриНачалеСогласования Тогда			
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПриНачалеСогласованияБыстрый Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПриНачалеСогласованияДолгий Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Истина;		
	ИначеЕсли Тип = ТипЗаданий.ПодготовкаОзнакомленияСогласования Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьHtmlПередОзнакомлением Тогда			
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПередОзнакомлениемБыстрый Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПередОзнакомлениемДолгий Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Истина;
	ИначеЕсли Тип = ТипЗаданий.ЗавершениеОзнакомленияСогласования Тогда			
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ВыполнениеЗадачи Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;			
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения Тогда			
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляОбработкиОбъекта Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СформироватьДанныеДляПредпросмотраФайла Тогда			
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ЗапускОбработкиПоЗадачеЭлемента Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ЗапускОбработкиПоОбработке Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДействиеОбработки Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьОбработкуОбъекта Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПереносСрокаВыполненияЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПеренаправлениеЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуПоСостояниюДействия Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуПриПеренаправлении Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.СохранитьРезультатВыполненияВЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПринятьКИсполнениюЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОтменитьПринятиеКИсполнениюЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь; 
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияМассовогоОзнакомления Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Истина;     
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуУчастникаМассовогоОзнакомления Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Истина;
	ИначеЕсли Тип = ТипЗаданий.ОбработатьИзменениеКонтейнеровДля2ФА Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьПроцессБезДействия Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ДобавитьУдалитьЗаполняемыйПредмет Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПрерватьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОстановитьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОтменитьВыполнениеЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОстановитьОбработку Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьОбработку Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ПерейтиКВыполнениюДействияВнеОчереди Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДействиеОзнакомленияЦеликомЕслиНужно Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ДолгоеЗадание = Ложь;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип задания.'");
	КонецЕсли;	
	
	Возврат ОписаниеТипа;
	
КонецФункции	

// Вернет типы для обработки на сервере
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервере() Экспорт
	
	ТипыВозврата = Новый Массив;
	
	ДЛя Каждого Значение Из Перечисления.ТипыЗаданий Цикл
		
		Описание = ОписаниеТипаЗадания(Значение);
		Если Описание.Сеанс = "Сервер" Тогда
			ТипыВозврата.Добавить(Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТипыВозврата;
	
КонецФункции	

// Вернет типы для обработки на сервере - долгие
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервереДолгие() Экспорт
	
	ТипыВозврата = Новый Массив;
	
	ДЛя Каждого Значение Из Перечисления.ТипыЗаданий Цикл
		
		Описание = ОписаниеТипаЗадания(Значение);
		Если Описание.Сеанс = "Сервер" И Описание.ДолгоеЗадание Тогда
			ТипыВозврата.Добавить(Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТипыВозврата;
	
КонецФункции	

// Вернет типы для обработки на сервере - быстрые
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервереБыстрые() Экспорт
	
	ТипыВозврата = Новый Массив;
	
	ДЛя Каждого Значение Из Перечисления.ТипыЗаданий Цикл
		
		Описание = ОписаниеТипаЗадания(Значение);
		Если Описание.Сеанс = "Сервер" И Не Описание.ДолгоеЗадание Тогда
			ТипыВозврата.Добавить(Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТипыВозврата;
	
КонецФункции	

// Вернет типы для обработки на клиенте
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаКлиенте() Экспорт
	
	ТипыВозврата = Новый Массив;
	
	ДЛя Каждого Значение Из Перечисления.ТипыЗаданий Цикл
		
		Описание = ОписаниеТипаЗадания(Значение);
		Если Описание.Сеанс = "Клиент" Тогда
			ТипыВозврата.Добавить(Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТипыВозврата;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
